## Terraform Checks


#### ✅ Terraform Format and Style Passed
#### ✅ Terraform Initialization Passed
#### ✅ Terraform Validation Passed
#### ✅ Terraform Plan Passed
<details>
<summary><code>terraform plan</code> output</summary>

```text
tls_private_key.key: Refreshing state... [id=27eb3343e1e33cf36b2c32b742247d600f2e3fe9]
data.cloudflare_zone.site-zone: Reading...
data.cloudflare_zone.site-zone: Read complete after 0s [id=1896d1131a72f9255386a78c50024864]
aws_key_pair.key: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL]
data.aws_ami.ubuntu-jammy: Reading...
aws_security_group.allow-vpn: Refreshing state... [id=sg-015a05d9f4e18232a]
aws_ebs_volume.ebs: Refreshing state... [id=vol-0d371ff3abebcc7f8]
data.aws_iam_policy_document.ec2-cloudwatch-logs: Reading...
data.aws_iam_policy_document.ec2-cloudwatch-logs: Read complete after 0s [id=2851119427]
aws_iam_role.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_iam_policy.ec2-cloudwatch-logs: Refreshing state... [id=arn:aws:iam::803205869942:policy/KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
data.aws_ami.ubuntu-jammy: Read complete after 0s [id=ami-0fc5d935ebf8bc3bc]
aws_iam_role_policy_attachment.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs-20230106063902346900000001]
aws_iam_instance_profile.ec2-cloudwatch-logs: Refreshing state... [id=KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs]
aws_instance.node: Refreshing state... [id=i-0baac5a768db2932d]
aws_eip.ip: Refreshing state... [id=eipalloc-0fd8f90c301c448a7]
aws_volume_attachment.ebs_att: Refreshing state... [id=vai-2724006212]
cloudflare_record.record: Refreshing state... [id=3dbc3636104e97d4d629bffa81773460]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_cloudwatch_log_group.log-group has been deleted
  - resource "aws_cloudwatch_log_group" "log-group" {
        id                = "KI5VMF-CLOUD-TUNNEL"
      - name              = "KI5VMF-CLOUD-TUNNEL" -> null
        tags              = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ebs_volume.ebs has been deleted
  - resource "aws_ebs_volume" "ebs" {
      - id                   = "vol-0d371ff3abebcc7f8" -> null
        tags                 = {}
        # (11 unchanged attributes hidden)
    }

  # aws_eip.ip has been deleted
  - resource "aws_eip" "ip" {
        id                   = "eipalloc-0fd8f90c301c448a7"
      - public_ip            = "18.189.227.206" -> null
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.node has been deleted
  - resource "aws_instance" "node" {
      - id                                   = "i-0baac5a768db2932d" -> null
        tags                                 = {
            "Name" = "KI5VMF-CLOUD-TUNNEL"
        }
        # (34 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # aws_key_pair.key has been deleted
  - resource "aws_key_pair" "key" {
        id          = "KI5VMF-CLOUD-TUNNEL"
      - key_name    = "KI5VMF-CLOUD-TUNNEL" -> null
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.allow-vpn has been deleted
  - resource "aws_security_group" "allow-vpn" {
      - id                     = "sg-015a05d9f4e18232a" -> null
        name                   = "KI5VMF-CLOUD-TUNNEL-vpn"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log-group will be created
  + resource "aws_cloudwatch_log_group" "log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "KI5VMF-CLOUD-TUNNEL"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ebs_volume.ebs will be created
  + resource "aws_ebs_volume" "ebs" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = true
      + final_snapshot    = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 8
      + snapshot_id       = (known after apply)
      + tags_all          = (known after apply)
      + throughput        = (known after apply)
      + type              = "gp2"
    }

  # aws_eip.ip will be created
  + resource "aws_eip" "ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_iam_policy.ec2-cloudwatch-logs will be updated in-place
  ~ resource "aws_iam_policy" "ec2-cloudwatch-logs" {
        id          = "arn:aws:iam::803205869942:policy/KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs"
        name        = "KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:logs:us-east-2:*:log-group:KI5VMF-CLOUD-TUNNEL",
                          - "arn:aws:logs:us-east-2:*:log-group:KI5VMF-CLOUD-TUNNEL:log-stream:*",
                          + "arn:aws:logs:us-east-1:*:log-group:KI5VMF-CLOUD-TUNNEL",
                          + "arn:aws:logs:us-east-1:*:log-group:KI5VMF-CLOUD-TUNNEL:log-stream:*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_instance.node will be created
  + resource "aws_instance" "node" {
      + ami                                  = "ami-0fc5d935ebf8bc3bc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "KI5VMF-CLOUD-TUNNEL-ec2-cloudwatch-logs"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "KI5VMF-CLOUD-TUNNEL"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "KI5VMF-CLOUD-TUNNEL"
        }
      + tags_all                             = {
          + "Name" = "KI5VMF-CLOUD-TUNNEL"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

  # aws_key_pair.key will be created
  + resource "aws_key_pair" "key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "KI5VMF-CLOUD-TUNNEL"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDcfn4i9tUfJcpqHXbFnLLVhHlNfE88GKBhUn7oWZ5OHB/hsmaIpyJ/vxlv0P3LQuNllrU8Q6QbvQWdxiEc7LEsEpAYXKtjeTB3lMaWtnSWO0CWqAsKCv1v9T06uNtMKpbf/TnSnE+cElTq33Pfp8bM1e+cwqq1UEzirOSgSZfONiTy96DnS7fsH2c13OdWS6EerDRT0X8iKWO+ZIarve4aNvaK4EUbTSBnwLDg6+aqobX6LtfjAcBCMgZ5mizDxKifYsHeiqqoapejqE3tSAIahpf40UDpyRpmI369ayLaMFZzo6sAb9qZIr2fnZlW5MqU7rLyHbJOTrCHhlGupZnNCbg8ncxlLHzWW7cQYggzF/AHE8tD2CWBATnTH1kgDRsFgdhoOkUqXpCwsKg/mEbBYjkfKySTI27kvAixXxh3KlwwfnlxV9UwOiuMb+qaaBZYvP11SS5uRy4uqqu7hqUR91YTo1dibqMgeiSeztWA1SltZ770w9nTG9+ZNcE06blccE1Iol7uEUEa+yQLbaO/VFTR9hQKn/pSgzn5ulNrmXC93RL0ZoWxjYuQX978DAmVQ0R63HytC0gvQ0Pzn6VbTWdrpkA27fG4GqvTMtcYtcdPgwRe8AOrtQOXvjsktpRBt1daorL7X6iEjKU/yiThRVZWTDk6NkA+/CkfIx/1rw=="
      + tags_all        = (known after apply)
    }

  # aws_security_group.allow-vpn will be created
  + resource "aws_security_group" "allow-vpn" {
      + arn                    = (known after apply)
      + description            = "Security Group for VTun VPN"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 51820
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 51820
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5525
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5525
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5526
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5526
            },
        ]
      + name                   = "KI5VMF-CLOUD-TUNNEL-vpn"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_volume_attachment.ebs_att will be created
  + resource "aws_volume_attachment" "ebs_att" {
      + device_name                    = "/dev/sdf"
      + id                             = (known after apply)
      + instance_id                    = (known after apply)
      + stop_instance_before_detaching = true
      + volume_id                      = (known after apply)
    }

  # cloudflare_record.record will be updated in-place
  ~ resource "cloudflare_record" "record" {
        id              = "3dbc3636104e97d4d629bffa81773460"
        name            = "aredn-cloud-node"
        tags            = []
      ~ value           = "18.189.227.206" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ public-ip = "18.189.227.206" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>